app/controllers/list_movies_controller.rb

    def index


        list_movie = ListMovie.all
---
SELECT "movies".* FROM "movies" WHERE "movies"."list_movie_id" = $1  [["list_movie_id", 5]]
SELECT "list_movies".* FROM "list_movies"

    def destroy

        lsit_movie = ListMovie.find(params[:id])
        lsit_movie.movies.destroy_all
        lsit_movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."list_movie_id" = $1  [["list_movie_id", 12]]
SELECT "list_movies".* FROM "list_movies" WHERE "list_movies"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "list_movies" WHERE "list_movies"."id" = $1  [["id", 12]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 17]]