app/controllers/movies_controller.rb

    def create
        list_movie = ListMovie.find_by(category: params["existing_list"])
        user = User.find(params[:id].to_i)
        list_c = ListMovie.create(category:params["list_movie"])
        if list_c.present?
        movie = Movie.new(name:params["name"], picture: params["picture"],
            rating: params[:rating].to_i, description: params["description"], extra_info: params["extra_info"],
            extra_url: params["extra_url"], list_movie_id: list_c.id)
            join = list_movie.user_list_movies.build(user_id:user.id, list_movie_id:list_movie.id)
            join.save
        else

         list_movie.present?
            movie = Movie.new(name:params["name"], picture: params["picture"],
                rating: params[:rating].to_i, description: params["description"], extra_info: params["extra_info"],
                extra_url: params["extra_url"], list_movie_id: list_movie.id)
         end

         if movie.valid?
            movie.save
---
SELECT "list_movies".* FROM "list_movies" WHERE "list_movies"."category" = $1 LIMIT $2  [["category", "Action"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "movies" ("name", "picture", "rating", "description", "extra_info", "created_at", "updated_at", "extra_url", "list_movie_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "list_movies" ("category", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["category", "war"], ["created_at", "2020-09-06 03:27:34.482320"], ["updated_at", "2020-09-06 03:27:34.482320"]]
INSERT INTO "user_list_movies" ("user_id", "list_movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["list_movie_id", 5], ["created_at", "2020-09-06 03:04:57.719815"], ["updated_at", "2020-09-06 03:04:57.719815"]]

    def selectDelete

        lsit_movie = ListMovie.find(params[:id])
        lsit_movie.movies.destroy_all
        lsit_movie.destroy
---
SELECT "list_movies".* FROM "list_movies" WHERE "list_movies"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 12]]